scripts/fixtures/followup-64k-run2/run2.log
INFO 09-03 08:19:03 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-03 08:19:03 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 09-03 08:19:03 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 09-03 08:19:03 [__init__.py:237] Platform plugin ascend is activated
INFO 09-03 08:19:03 [platform.py:62] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
2026-09-03 08:19:09,915 - 101164 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.24.0+empty: default 1
INFO 09-03 08:19:10 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 09-03 08:19:10 [__init__.py:112] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffef4f213a0>, trust_remote_code=True, seed=0, num_prompts=256, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=65536, random_output_len=1024, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='glm52-w8a8', input_len=None, output_len=None, tokenizer='/data/tiankuan/zyg/model/GLM-5.2-w8a8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/data/tiankuan/od-64k/benchmark-64k-rerun', result_filename='run2.json', ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-672efbbe-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-03 08:19:12 [utils.py:90] Sampling input_len from [65536, 65536] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 256/256 [2:41:16<00:00, 37.80s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  9676.40   
Total input tokens:                      16777216  
Total generated tokens:                  262144    
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         27.09     
Peak output token throughput (tok/s):    48.00     
Peak concurrent requests:                66.00     
Total token throughput (tok/s):          1760.92   
---------------Time to First Token----------------
Mean TTFT (ms):                          2064099.81
Median TTFT (ms):                        2281468.94
P99 TTFT (ms):                           2429862.46
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          46.16     
Median TPOT (ms):                        45.59     
P99 TPOT (ms):                           47.34     
---------------Inter-token Latency----------------
Mean ITL (ms):                           46.16     
Median ITL (ms):                         45.33     
P99 ITL (ms):                            46.13     
==================================================